Allrun
#!/bin/sh
cd ${0%/*} || exit 1 # Run from this directory

./Allclean

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="$(getApplication)"

runApplication blockMesh

runApplication $application

postProcess -func sampleDict

paraview --state=state.pvsm

#------------------------------------------------------------------------------
